<?php

return [
//    authintication messages
    'create_new_user' => 'اهلا بك في تطبيق بيت العباقرة , تم انشاء حسابك بنجاح',
    'login' => 'اهلا بعودتك :name تم تسجيل دخولك بنجاح',
    'logout' => 'الى اللقاء عزيزي :name تم تسجيل خروجك بنجاح',
//    not found messages
    'user_not_found' => 'للاسف و لم نستطيع ايجاد هذا الحساب تحقق من كتابته جيدا وحاول من جديد',
    'course_not_found' => 'للاسف و لم نستطيع ايجاد هذه الدورة التدريبية في نظامنا',
    'news_not_found' => 'لم يتم العثور على هذا الخبر في قائمة الاخبار الخاصة بنا',
    'category_not_found' => 'لم يتم العثور على هذا التنصيف في قائمة التصنيفات',
    'activation_code_not_found' => 'كود الدورة التدريبية الخاص بك غير صحيح',
    'question_not_found' => 'هذا السؤال غير موجود في قائمة الاسئلة الخاصة بنا',
    'choice_not_found' => 'هذا الخيار غير موجود في قائمة الخيارات الخاصة بذا السؤال',
    'value_not_found' => 'هذا القيمة غير موجودة في قائمة القيم المتعلمة من هذه الدورة',
    'quiz_not_found' => 'هذا المذاكرة غير موجودة في قائمة المذاكرات لدينا',
    'update_question' => 'تم تعديل السؤال بنجاح',
    'delete_question' => 'تم حذف السؤال بنجاح',
    'create_question' => 'تم انشاء سؤال جديد بنجاح',
    'create_choice' => 'تم اضافة الخيار الجديد بنجاح',
    'delete_choice' => 'تم حذف الخيار بنجاح',
    'delete_quiz' => 'تم حذف المذاكرة بنجاح',
    'delete_question_quiz' => 'تم حذف السؤال من المذاكرة يمكنك اصافته مرة اخرى في وقت لاحق',
    'delete_course_value' => 'تم حذف القيمة بنجاح',
    'update_course_value' => 'تم تعديل القيمة بنجاح',
    'update_choice' => 'تم تعديل الخيار بنجاح',
    'update_quiz' => 'تم تعديل المذاكرة بنجاح',
    'create_quiz' => 'تم انشاء المذاكرة بنجاح',
    'create_course_value' => 'تم اضافة قيمة جديدة لهذا الكورس',
    'question_pre_add_to_quiz' => 'هذا السؤال سبق وان اضيف الى هذه المذاكرة',
    'question_add_to_quiz' => 'تم اضافة السؤال الى المذاكرة بنجاح',
    'question_quiz_not_found' => 'لم يتم العثور على هذا السؤال في هذه المذاكرة',
    'switch_visibility_question_quiz' => 'تم تبديل حالة ظهور السؤال ضمن المذاكرة بنجاح',



    'activation_code_expired' => 'للاسف كود التفعيل الخاص بك منتهي الصلاحية',
    'shared_activation_code_already_used_for_this_course' => 'لقد استخدمت كود تفعيل الاشتراك الخصاص بك من اجل هذا الكورس مسبقا',
    'sign_in_course_successfully' => 'تم تسجيل الدخول الى دورة :course بنجاح , مع تمنياتنا بالتوفيق',
    'wrong_match_course_with_code' => 'انا هذا الكود غير صالج لتفعيل هذا الكورس',


    'login_password_email_error' => 'يوجد خطأ في البريد الاكتروني او كلمة المرور تأكد وعاود المحاولة',
    'block_while_login_message' => 'لا يمكن نسجيل الدخول باستخدام هذا الحساب في هذا الهاتف لذلك تم حظر هذا الحساب مؤقتاً , راجع مدير النظم لحل المشكلة',
    'account_blocked' => 'هذا الحساب مظور ولا يمكنه القيام بأي عملية , راجع مدير النظام لحل المشكلة ورفع الحظر عن الحساب',

    'course_invisible_sign_in' => 'لا يمكنك الانضمام لهذه الدورة التدريبية الان يمكنك المحاولة فيما بعد',
    'already_sign_in_course' => 'لقد سجلت مسبقاً في هذه الدورة التدريبية',

//    permission messages
    'permission_denied' => 'عذرا لا يمكمك اكمال هذه العملية نظرا لانك لا تملك الصلاحيات المناسبة لها',
    'user_blocked' => 'تم :block_state بنجاج',
    'block_word' => 'الحظر',
    'unblock_word' => 'الفاء الحظر',
    'delete_news' => 'تم حذف الخبر من قائمة الاخبار بنجاح',

];
